# Eksploracja danych w Pandas

## Wczytanie danych Titanic

In [1]:
import pandas as pd

# Pobieranie danych bezpośrednio z internetu
# Opis danych https://www.kaggle.com/c/titanic/data
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url).set_index('PassengerId')

display(df)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Brakujące wartości

In [2]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [3]:
df.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#display(df.isna().any(axis = 0)) # Bool czy są puste
#display(df.isna().any(axis = 1)) # Czy puste wiersze
#print(df.isna().sum()) # Sumowanie po kolumnach
print(df.isna().sum(axis=1)) # Sumowanie po wierszach

PassengerId
1      1
2      0
3      1
4      0
5      1
      ..
887    1
888    0
889    2
890    0
891    1
Length: 891, dtype: int64

## Usuwanie brakujących wartości

In [6]:
df.groupby(["Pclass"])["Age"].agg("median")

Pclass
1    37.0
2    29.0
3    24.0
Name: Age, dtype: float64

In [7]:
#df_dropna = df.dropna()  # Usunięcie wszystkich wierszy z brakującymi wartościami

## Usunięcie wszystkich wierszy z brakującymi wartościami w danych kolumnach
df_dropna = df.dropna(subset=['Age'])  
#display(df_dropna)
#
## Uzupełnienie medianą wieku
#df_fillna = df.fillna({"Age": df["Age"].median(), "Embarked": df['Embarked'].mode()[0]})  
#display(df_fillna.isna().any())
#
## Usuwanie wierszy z dużą liczbą braków UZUPEŁNIĆ
#prog = len(df.columns) - 0 # ILE MINIMALNIE NIEPUSTYCH BY ZOSTAWIĆ
#df_cleaned = df.dropna(thresh=prog, axis=1)
#display(df_cleaned)
#
## Wypełnianie na podstawie innej kolumny
median_age_by_class = df.groupby("Pclass")["Age"].transform(lambda x: x.fillna(x.median()))
#df["Age"] = median_age_by_class

# Alternatywnie
df['mediana_dla_odpowiedniego_pclass'] = df.groupby(["Pclass"])["Age"].transform("median")
df['Age_wypełniony'] = df['Age'].fillna(df['mediana_dla_odpowiedniego_pclass'])

df['Age_wypełniony'].isna().any()

False

### Ćwiczenie: 
1. Wypełnij brakujące wartości w kolumnie "Embarked" najczęstszą wartością
2. Wypełnij brakujące wartości w kolumnie "Cabin" wartością "Unknown"
3. Sprawdź, ile wartości w kolumnie "Cabin" jest nadal pustych po wcześniejszym wypełnieniu
4. Wypełnij brakujące wartości w kolumnie "Age" średnią wieku dla danej płci "Sex"

In [8]:
# 1
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
# 2
df['Cabin'] = df['Cabin'].fillna('Unknown')
# 3
df['Cabin'].isna().sum()
# 4
df['srednia_wieku_plec'] = df.groupby(['Sex'])['Age'].transform('mean')
df['Age'] = df['Age'].fillna(df['srednia_wieku_plec'])

## Grupowanie i agregacja

In [9]:
# Funkcja value_counts()
#display(df[['Survived', 'Sex']].value_counts())

# Funkcja groupby
# Grupowanie wg klasy i płci, średnia przeżywalność
agg_survival = df.groupby(["Pclass", "Sex"])['Survived'].mean()
display(agg_survival)
# Output jako DataFrame
agg_survival = df.groupby(["Pclass", "Sex"])[['Survived']].mean()
display(agg_survival)

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

               Survived
Pclass Sex
1      female  0.968085
       male    0.368852
2      female  0.921053
       male    0.157407
3      female  0.500000
       male    0.135447

### Ćwiczenie: 
1. Policz medianę wieku dla każdej klasy pasażerów
2. Oblicz średnią cenę biletu dla każdej kombinacji "Pclass" i "Embarked"
3. Sprawdź maksymalną liczbę rodzeństwa i rodziców podróżujących razem dla każdej klasy

In [10]:
# 1
df.groupby('Pclass')[['Age']].median()
# 2
df.groupby(['Pclass', 'Embarked'])['Fare'].mean()

Pclass  Embarked
1       C           104.718529
        Q            90.000000
        S            70.514244
2       C            25.358335
        Q            12.350000
        S            20.327439
3       C            11.214083
        Q            11.183393
        S            14.644083
Name: Fare, dtype: float64

## Różne rodzaje agregacji

### Funkcje używane na `groupby` w Pandas

Po zastosowaniu `.groupby()` w Pandas można korzystać z różnych funkcji agregujących, transformujących i filtrujących dane.

#### **Funkcje agregujące (`.agg()`)**
Te funkcje zwracają jedną wartość dla każdej grupy:

- `.sum()` – suma wartości w grupie
- `.mean()` – średnia arytmetyczna
- `.median()` – mediana
- `.min()` – najmniejsza wartość
- `.max()` – największa wartość
- `.count()` – liczba elementów w grupie
- `.nunique()` – liczba unikalnych wartości w grupie
- `.first()` – pierwszy element w grupie
- `.last()` – ostatni element w grupie
- `.prod()` – iloczyn wartości
- `.std()` – odchylenie standardowe
- `.var()` – wariancja
- `.head(n)` - n pierwszych wartości
- `.tail(n)` - n ostatnich wartości

#### **Funkcje transformujące (`.transform()`)**
Te funkcje zwracają wartość dla każdego wiersza, zachowując oryginalny rozmiar:

- `.cumsum()` – skumulowana suma
- `.cumprod()` – skumulowany iloczyn
- `.rank()` – ranking wartości w grupie
- `.fillna()` – wypełnienie brakujących wartości
- `.ffill()` / `.bfill()` – propagacja wartości do przodu i do tyłu
- `.shift(n)` – przesunięcie wartości o `n` pozycji

In [30]:
# Grupowanie po klasie biletu
aggs = df.groupby(["Pclass", 'Embarked']).agg({
    "Age": ["mean", "median", "min", "max", "std"],
    "Fare": ["sum", "mean", "max", "min", "std"],
    "Survived": ["count", "sum", "mean"]
})
#display(aggs.reset_index())



# Grupowanie po płci
df_grouped = df.groupby(["Sex"]).agg({
    "Age": "mean",
    "Fare": "sum",
    "Survived": ["mean", "count"]
})
display(df_grouped)

              Age        Fare  Survived
             mean         sum      mean count
Sex
female  27.915709  13966.6628  0.742038   314
male    30.726645  14727.2865  0.188908   577

### Ćwiczenie: 
1. Oblicz odchylenie standardowe ceny biletu dla każdej klasy
2. Policz liczbę pasażerów dla każdej kombinacji "Pclass" i "Sex"

In [35]:
#1
df.groupby('Pclass')['Fare'].std()
#2
df[['Pclass', 'Sex']].value_counts()

Pclass  Sex
3       male      347
        female    144
1       male      122
2       male      108
1       female     94
2       female     76
Name: count, dtype: int64

## Sortowanie danych

In [38]:
# Sortowanie po wieku i cenie biletu
#df_sorted = df.sort_values(by=["Age", "Fare"], ascending=[False, False])
#display(df_sorted.head(10))

df_sorted_multi = df.sort_values(by=["Pclass", "Survived", "Age"], ascending=[True, False, True])
display(df_sorted_multi.head())

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,mediana_dla_odpowiedniego_pclass,Age_wypełniony,srednia_wieku_plec
PassengerId,,,,,,,,,,,,,,
306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,37.0,0.92,30.726645
446,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S,37.0,4.00,30.726645
803,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,113760,120.0000,B96 B98,S,37.0,11.00,30.726645
436,1,1,"Carter, Miss. Lucile Polk",female,14.00,1,2,113760,120.0000,B96 B98,S,37.0,14.00,27.915709
690,1,1,"Madill, Miss. Georgette Alexandra",female,15.00,0,1,24160,211.3375,B5,S,37.0,15.00,27.915709

### Ćwiczenie: 
Posortuj dane po płci i wieku rosnąco

In [39]:
df.sort_values(by = ['Sex', 'Age'], ascending = True)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,mediana_dla_odpowiedniego_pclass,Age_wypełniony,srednia_wieku_plec
PassengerId,,,,,,,,,,,,,,
470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,Unknown,C,24.0,0.75,27.915709
645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,Unknown,C,24.0,0.75,27.915709
173,1,3,"Johnson, Miss. Eleanor Ileen",female,1.00,1,1,347742,11.1333,Unknown,S,24.0,1.00,27.915709
382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.00,0,2,2653,15.7417,Unknown,C,24.0,1.00,27.915709
120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.00,4,2,347082,31.2750,Unknown,S,24.0,2.00,27.915709
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,0,3,"Connors, Mr. Patrick",male,70.50,0,0,370369,7.7500,Unknown,Q,24.0,70.50,30.726645
97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C,37.0,71.00,30.726645
494,0,1,"Artagaveytia, Mr. Ramon",male,71.00,0,0,PC 17609,49.5042,Unknown,C,37.0,71.00,30.726645
852,0,3,"Svensson, Mr. Johan",male,74.00,0,0,347060,7.7750,Unknown,S,24.0,74.00,30.726645
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S,37.0,80.00,30.726645